Revit 2024 API
Transform1D.OfPoint Method
 Applies the transformation to the 1-dimensional point and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public double OfPoint(
	double point
)
Visual Basic
Public Function OfPoint ( _
	point As Double _
) As Double
Visual C++
public:
double OfPoint(
	double point
)
Parameters
point
Type: System.Double
 The point to transform.
Return Value
 The transformed point.
Remarks
 Transformation of a point is affected by the translational part of the transformation.
See Also
Transform1D Class
Autodesk.Revit.DB Namespace